import pytest

from Rating_Generator.Generator import rating_generator


@pytest.mark.parametrize("cond, exp", [
    (0, 'На экзамен не явился'),
    (1, "Не сдал"),
    (39, "Не сдал"),
    (2, "Не сдал"),
    (38, "Не сдал"),
    (20, "Не сдал"),
    (40, "Оценка - 3"),
    (59, "Оценка - 3"),
    (41, "Оценка - 3"),
    (58, "Оценка - 3"),
    (60, "Оценка - 4"),
    (79, "Оценка - 4"),
    (61, "Оценка - 4"),
    (78, "Оценка - 4"),
    (70, "Оценка - 4"),
    (80, "Оценка - 5"),
    (100, "Оценка - 5"),
    (81, "Оценка - 5"),
    (99, "Оценка - 5"),
    (90, "Оценка - 5"),
    (-1, "Невалидное значение"),
    (101, "Невалидное значение")

])
def test_raiting_generator_positive(cond, exp):
    assert rating_generator(cond) == exp
